tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18875_tdd.h
#define C1INTN                        2765
#define CM1CON1_INTN                  2766
#define CM1CON1_INTP                  2767
#define C1INTP                        2768
#define CM1NSEL                       2769
#define CM1NSEL_NCH0                  2770
#define C1NCH0                        2771
#define CM1NSEL_NCH                   2772
#define C1NCH                         2773
#define CM1NSEL_NCH1                  2774
#define C1NCH1                        2775
#define CM1NSEL_NCH2                  2776
#define C1NCH2                        2777
#define CM1PSEL                       2778
#define CM1PSEL_PCH                   2779
#define C1PCH                         2780
#define C1PCH0                        2781
#define CM1PSEL_PCH0                  2782
#define C1PCH1                        2783
#define CM1PSEL_PCH1                  2784
#define C1PCH2                        2785
#define CM1PSEL_PCH2                  2786
#define CM2CON0                       2787
#define CM2CON0_SYNC                  2788
#define C2SYNC                        2789
#define C2HYS                         2790
#define CM2CON0_HYS                   2791
#define C2SP                          2792
#define C2POL                         2793
#define CM2CON0_POL                   2794
#define CM2CON0_C2OUT                 2795
#define CM2CON0_OUT                   2796
#define CM2CON0_ON                    2797
#define C2ON                          2798
#define CM2CON1                       2799
#define C2INTN                        2800
#define CM2CON1_INTN                  2801
#define CM2CON1_INTP                  2802
#define C2INTP                        2803
#define CM2NSEL                       2804
#define C2NCH0                        2805
#define CM2NSEL_NCH0                  2806
#define C2NCH                         2807
#define CM2NSEL_NCH                   2808
#define C2NCH1                        2809
#define CM2NSEL_NCH1                  2810
#define C2NCH2                        2811
#define CM2NSEL_NCH2                  2812
#define CM2PSEL                       2813
#define CM2PSEL_PCH                   2814
#define C2PCH                         2815
#define C2PCH0                        2816
#define CM2PSEL_PCH0                  2817
#define C2PCH1                        2818
#define CM2PSEL_PCH1                  2819
#define CM2PSEL_PCH2                  2820
#define C2PCH2                        2821
#define CLCDATA                       2822
#define MLC1OUT                       2823
#define MLC2OUT                       2824
#define MLC3OUT                       2825
#define MLC4OUT                       2826
#define CLC1CON                       2827
#define CLC1CON_MODE                  2828
#define LC1MODE0                      2829
#define LC1MODE                       2830
#define CLC1CON_MODE0                 2831
#define LC1MODE1                      2832
#define CLC1CON_MODE1                 2833
#define LC1MODE2                      2834
#define CLC1CON_MODE2                 2835
#define LC1INTN                       2836
#define CLC1CON_INTN                  2837
#define LC1INTP                       2838
#define CLC1CON_INTP                  2839
#define LC1OUT                        2840
#define CLC1CON_OUT                   2841
#define LC1EN                         2842
#define CLC1CON_EN                    2843
#define CLC1POL                       2844
#define LC1G1POL                      2845
#define CLC1POL_G1POL                 2846
#define CLC1POL_G2POL                 2847
#define LC1G2POL                      2848
#define LC1G3POL                      2849
#define CLC1POL_G3POL                 2850
#define LC1G4POL                      2851
#define CLC1POL_G4POL                 2852
#define CLC1POL_POL                   2853
#define LC1POL                        2854
#define CLC1SEL0                      2855
#define LC1D1S                        2856
#define CLC1SEL0_D1S0                 2857
#define LC1D1S0                       2858
#define CLC1SEL0_D1S                  2859
#define CLC1SEL0_D1S1                 2860
#define LC1D1S1                       2861
#define CLC1SEL0_D1S2                 2862
#define LC1D1S2                       2863
#define CLC1SEL0_D1S3                 2864
#define LC1D1S3                       2865
#define LC1D1S4                       2866
#define CLC1SEL0_D1S4                 2867
#define CLC1SEL0_D1S5                 2868
#define LC1D1S5                       2869
#define LC1D1S6                       2870
#define CLC1SEL0_D1S6                 2871
#define LC1D1S7                       2872
#define CLC1SEL0_D1S7                 2873
#define CLC1SEL1                      2874
#define CLC1SEL1_D2S                  2875
#define CLC1SEL1_D2S0                 2876
#define LC1D2S0                       2877
#define LC1D2S                        2878
#define CLC1SEL1_D2S1                 2879
#define LC1D2S1                       2880
#define CLC1SEL1_D2S2                 2881
#define LC1D2S2                       2882
#define CLC1SEL1_D2S3                 2883
#define LC1D2S3                       2884
#define LC1D2S4                       2885
#define CLC1SEL1_D2S4                 2886
#define D2S5                          2887
#define LC1D2S5                       2888
#define LC1D2S6                       2889
#define CLC1SEL1_D2S6                 2890
#define CLC1SEL1_D2S7                 2891
#define LC1D2S7                       2892
#define CLC1SEL2                      2893
#define CLC1SEL2_D3S                  2894
#define LC1D3S0                       2895
#define LC1D3S                        2896
#define CLC1SEL2_D3S0                 2897
#define LC1D3S1                       2898
#define CLC1SEL2_D3S1                 2899
#define LC1D3S2                       2900
#define CLC1SEL2_D3S2                 2901
#define LC1D3S3                       2902
#define CLC1SEL2_D3S3                 2903
#define LC1D3S4                       2904
#define CLC1SEL2_D3S4                 2905
#define LC1D3S5                       2906
#define CLC1SEL2_D3S5                 2907
#define LC1D3S6                       2908
#define CLC1SEL2_D3S6                 2909
#define LC1D3S7                       2910
#define CLC1SEL2_D3S7                 2911
#define CLC1SEL3                      2912
#define LC1D4S                        2913
#define CLC1SEL3_D4S                  2914
#define LC1D4S0                       2915
#define CLC1SEL3_D4S0                 2916
#define LC1D4S1                       2917
#define CLC1SEL3_D4S1                 2918
#define LC1D4S2                       2919
#define CLC1SEL3_D4S2                 2920
#define LC1D4S3                       2921
#define CLC1SEL3_D4S3                 2922
#define LC1D4S4                       2923
#define CLC1SEL3_D4S4                 2924
#define LC1D4S5                       2925
#define CLC1SEL3_D4S5                 2926
#define LC1D4S6                       2927
#define CLC1SEL3_D4S6                 2928
#define LC1D4S7                       2929
#define CLC1SEL3_D4S7                 2930
#define CLC1GLS0                      2931
#define CLC1GLS0_D1N                  2932
#define LC1G1D1N                      2933
#define CLC1GLS0_D1T                  2934
#define LC1G1D1T                      2935
#define LC1G1D2N                      2936
#define CLC1GLS0_D2N                  2937
#define LC1G1D2T                      2938
#define CLC1GLS0_D2T                  2939
#define CLC1GLS0_D3N                  2940
#define LC1G1D3N                      2941
#define CLC1GLS0_D3T                  2942
#define LC1G1D3T                      2943
#define CLC1GLS0_D4N                  2944
#define LC1G1D4N                      2945
#define CLC1GLS0_D4T                  2946
#define LC1G1D4T                      2947
#define CLC1GLS1                      2948
#define CLC1GLS1_D1N                  2949
#define LC1G2D1N                      2950
#define LC1G2D1T                      2951
#define CLC1GLS1_D1T                  2952
#define CLC1GLS1_D2N                  2953
#define LC1G2D2N                      2954
#define LC1G2D2T                      2955
#define CLC1GLS1_D2T                  2956
#define CLC1GLS1_D3N                  2957
#define LC1G2D3N                      2958
#define LC1G2D3T                      2959
#define CLC1GLS1_D3T                  2960
#define CLC1GLS1_D4N                  2961
#define LC1G2D4N                      2962
#define LC1G2D4T                      2963
#define CLC1GLS1_D4T                  2964
#define CLC1GLS2                      2965
#define CLC1GLS2_D1N                  2966
#define LC1G3D1N                      2967
#define LC1G3D1T                      2968
#define CLC1GLS2_D1T                  2969
#define LC1G3D2N                      2970
#define CLC1GLS2_D2N                  2971
#define LC1G3D2T                      2972
#define CLC1GLS2_D2T                  2973
#define CLC1GLS2_D3N                  2974
#define LC1G3D3N                      2975
#define LC1G3D3T                      2976
#define CLC1GLS2_D3T                  2977
#define LC1G3D4N                      2978
#define CLC1GLS2_D4N                  2979
#define LC1G3D4T                      2980
#define CLC1GLS2_D4T                  2981
#define CLC1GLS3                      2982
#define LC1G4D1N                      2983
#define CLC1GLS3_G4D1N                2984
#define LC1G4D1T                      2985
#define CLC1GLS3_G4D1T                2986
#define CLC1GLS3_G4D2N                2987
#define LC1G4D2N                      2988
#define CLC1GLS3_G4D2T                2989
#define LC1G4D2T                      2990
#define LC1G4D3N                      2991
#define CLC1GLS3_G4D3N                2992
#define LC1G4D3T                      2993
#define CLC1GLS3_G4D3T                2994
#define CLC1GLS3_G4D4N                2995
#define LC1G4D4N                      2996
#define CLC1GLS3_G4D4T                2997
#define LC1G4D4T                      2998
#define CLC2CON                       2999
#define LC2MODE0                      3000
#define CLC2CON_MODE                  3001
#define LC2MODE                       3002
#define CLC2CON_MODE0                 3003
#define LC2MODE1                      3004
#define CLC2CON_MODE1                 3005
#define LC2MODE2                      3006
#define CLC2CON_MODE2                 3007
#define LC2INTN                       3008
#define CLC2CON_INTN                  3009
#define LC2INTP                       3010
#define CLC2CON_INTP                  3011
#define CLC2CON_OUT                   3012
#define LC2OUT                        3013
#define CLC2CON_EN                    3014
#define LC2EN                         3015
#define CLC2POL                       3016
#define LC2G1POL                      3017
#define CLC2POL_G1POL                 3018
#define LC2G2POL                      3019
#define CLC2POL_G2POL                 3020
#define LC2G3POL                      3021
#define CLC2POL_G3POL                 3022
#define LC2G4POL                      3023
#define CLC2POL_G4POL                 3024
#define CLC2POL_POL                   3025
#define LC2POL                        3026
#define CLC2SEL0                      3027
#define CLC2SEL0_D1S                  3028
#define LC2D1S                        3029
#define LC2D1S0                       3030
#define CLC2SEL0_D1S0                 3031
#define LC2D1S1                       3032
#define CLC2SEL0_D1S1                 3033
#define LC2D1S2                       3034
#define CLC2SEL0_D1S2                 3035
#define LC2D1S3                       3036
#define CLC2SEL0_D1S3                 3037
#define LC2D1S4                       3038
#define CLC2SEL0_D1S4                 3039
#define LC2D1S5                       3040
#define CLC2SEL0_D1S5                 3041
#define LC2D1S6                       3042
#define CLC2SEL0_D1S6                 3043
#define LC2D1S7                       3044
#define CLC2SEL0_D1S7                 3045
#define CLC2SEL1                      3046
#define LC2D2S0                       3047
#define LC2D2S                        3048
#define CLC2SEL1_D2S                  3049
#define CLC2SEL1_D2S0                 3050
#define LC2D2S1                       3051
#define CLC2SEL1_D2S1                 3052
#define LC2D2S2                       3053
#define CLC2SEL1_D2S2                 3054
#define LC2D2S3                       3055
#define CLC2SEL1_D2S3                 3056
#define LC2D2S4                       3057
#define CLC2SEL1_D2S4                 3058
#define LC2D2S5                       3059
#define CLC2SEL1_D2S5                 3060
#define LC2D2S6                       3061
#define CLC2SEL1_D2S6                 3062
#define LC2D2S7                       3063
#define CLC2SEL1_D2S7                 3064
#define CLC2SEL2                      3065
#define CLC2SEL2_D3S0                 3066
#define LC2D3S                        3067
#define CLC2SEL2_D3S                  3068
#define LC2D3S0                       3069
#define CLC2SEL2_D3S1                 3070
#define LC2D3S1                       3071
#define CLC2SEL2_D3S2                 3072
#define LC2D3S2                       3073
#define CLC2SEL2_D3S3                 3074
#define LC2D3S3                       3075
#define CLC2SEL2_D3S4                 3076
#define LC2D3S4                       3077
#define CLC2SEL2_D3S5                 3078
#define LC2D3S5                       3079
#define CLC2SEL2_D3S6                 3080
#define LC2D3S6                       3081
#define CLC2SEL2_D3S7                 3082
#define LC2D3S7                       3083
#define CLC2SEL3                      3084
#define LC2D4S                        3085
#define CLC2SEL3_D4S0                 3086
#define LC2D4S0                       3087
#define CLC2SEL3_D4S                  3088
#define CLC2SEL3_D4S1                 3089
#define LC2D4S1                       3090
#define CLC2SEL3_D4S2                 3091
#define LC2D4S2                       3092
#define CLC2SEL3_D4S3                 3093
#define LC2D4S3                       3094
#define CLC2SEL3_D4S4                 3095
#define LC2D4S4                       3096
#define CLC2SEL3_D4S5                 3097
#define LC2D4S5                       3098
#define CLC2SEL3_D4S6                 3099
#define LC2D4S6                       3100
#define CLC2SEL3_D4S7                 3101
#define LC2D4S7                       3102
#define CLC2GLS0                      3103
#define LC2G1D1N                      3104
#define CLC2GLS0_D1N                  3105
#define CLC2GLS0_D1T                  3106
#define LC2G1D1T                      3107
#define LC2G1D2N                      3108
#define CLC2GLS0_D2N                  3109
#define CLC2GLS0_D2T                  3110
#define LC2G1D2T                      3111
#define LC2G1D3N                      3112
#define CLC2GLS0_D3N                  3113
#define CLC2GLS0_D3T                  3114
#define LC2G1D3T                      3115
#define LC2G1D4N                      3116
#define CLC2GLS0_D4N                  3117
#define CLC2GLS0_D4T                  3118
#define LC2G1D4T                      3119
#define CLC2GLS1                      3120
#define CLC2GLS1_D1N                  3121
#define LC2G2D1N                      3122
#define CLC2GLS1_D1T                  3123
#define LC2G2D1T                      3124
#define CLC2GLS1_D2N                  3125
#define LC2G2D2N                      3126
#define CLC2GLS1_D2T                  3127
#define LC2G2D2T                      3128
#define LC2G2D3N                      3129
#define CLC2GLS1_D3N                  3130
#define LC2G2D3T                      3131
#define CLC2GLS1_D3T                  3132
#define LC2G2D4N                      3133
#define CLC2GLS1_D4N                  3134
#define LC2G2D4T                      3135
#define CLC2GLS1_D4T                  3136
#define CLC2GLS2                      3137
#define LC2G3D1N                      3138
#define CLC2GLS2_D1N                  3139
#define CLC2GLS2_D1T                  3140
#define LC2G3D1T                      3141
#define CLC2GLS2_D2N                  3142
#define LC2G3D2N                      3143
#define LC2G3D2T                      3144
#define CLC2GLS2_D2T                  3145
#define CLC2GLS2_D3N                  3146
#define LC2G3D3N                      3147
#define CLC2GLS2_D3T                  3148
#define LC2G3D3T                      3149
#define CLC2GLS2_D4N                  3150
#define LC2G3D4N                      3151
#define LC2G3D4T                      3152
#define CLC2GLS2_D4T                  3153
#define CLC2GLS3                      3154
#define LC2G4D1N                      3155
#define CLC2GLS3_G4D1N                3156
#define CLC2GLS3_G4D1T                3157
#define LC2G4D1T                      3158
#define CLC2GLS3_G4D2N                3159
#define LC2G4D2N                      3160
#define LC2G4D2T                      3161
#define CLC2GLS3_G4D2T                3162
#define CLC2GLS3_G4D3N                3163
#define LC2G4D3N                      3164
#define CLC2GLS3_G4D3T                3165
#define LC2G4D3T                      3166
#define LC2G4D4N                      3167
#define CLC2GLS3_G4D4N                3168
#define CLC2GLS3_G4D4T                3169
#define LC2G4D4T                      3170
#define CLC3CON                       3171
#define LC3MODE                       3172
#define CLC3CON_MODE0                 3173
#define LC3MODE0                      3174
#define CLC3CON_MODE                  3175
#define CLC3CON_MODE1                 3176
#define LC3MODE1                      3177
#define CLC3CON_MODE2                 3178
#define LC3MODE2                      3179
#define LC3INTN                       3180
#define CLC3CON_INTN                  3181
#define LC3INTP                       3182
#define CLC3CON_INTP                  3183
#define LC3OUT                        3184
#define CLC3CON_OUT                   3185
#define LC3EN                         3186
#define CLC3CON_EN                    3187
#define CLC3POL                       3188
#define LC3G1POL                      3189
#define CLC3POL_G1POL                 3190
#define LC3G2POL                      3191
#define CLC3POL_G2POL                 3192
#define CLC3POL_G3POL                 3193
#define LC3G3POL                      3194
#define LC3G4POL                      3195
#define CLC3POL_G4POL                 3196
#define LC3POL                        3197
#define CLC3POL_POL                   3198
#define CLC3SEL0                      3199
#define LC3D1S                        3200
#define CLC3SEL0_D1S                  3201
#define LC3D1S0                       3202
#define CLC3SEL0_D1S0                 3203
#define LC3D1S1                       3204
#define CLC3SEL0_D1S1                 3205
#define LC3D1S2                       3206
#define CLC3SEL0_D1S2                 3207
#define LC3D1S3                       3208
#define CLC3SEL0_D1S3                 3209
#define LC3D1S4                       3210
#define CLC3SEL0_D1S4                 3211
#define LC3D1S5                       3212
#define CLC3SEL0_D1S5                 3213
#define LC3D1S6                       3214
#define CLC3SEL0_D1S6                 3215
#define LC3D1S7                       3216
#define CLC3SEL0_D1S7                 3217
#define CLC3SEL1                      3218
#define LC3D2S0                       3219
#define LC3D2S                        3220
#define CLC3SEL1_D2S0                 3221
#define CLC3SEL1_D2S                  3222
#define LC3D2S1                       3223
#define CLC3SEL1_D2S1                 3224
#define LC3D2S2                       3225
#define CLC3SEL1_D2S2                 3226
#define LC3D2S3                       3227
#define CLC3SEL1_D2S3                 3228
#define LC3D2S4                       3229
#define CLC3SEL1_D2S4                 3230
#define LC3D2S5                       3231
#define CLC3SEL1_D2S5                 3232
#define LC3D2S6                       3233
#define CLC3SEL1_D2S6                 3234
#define LC3D2S7                       3235
#define CLC3SEL1_D2S7                 3236
#define CLC3SEL2                      3237
#define LC3D3S                        3238
#define CLC3SEL2_D3S                  3239
#define LC3D3S0                       3240
#define CLC3SEL2_D3S0                 3241
#define LC3D3S1                       3242
#define CLC3SEL2_D3S1                 3243
#define LC3D3S2                       3244
#define CLC3SEL2_D3S2                 3245
#define LC3D3S3                       3246
#define CLC3SEL2_D3S3                 3247
#define LC3D3S4                       3248
#define CLC3SEL2_D3S4                 3249
#define LC3D3S5                       3250
#define CLC3SEL2_D3S5                 3251
#define LC3D3S6                       3252
#define CLC3SEL2_D3S6                 3253
#define LC3D3S7                       3254
#define CLC3SEL2_D3S7                 3255
#define CLC3SEL3                      3256
#define CLC3SEL3_D4S                  3257
#define LC3D4S0                       3258
#define LC3D4S                        3259
#define CLC3SEL3_D4S0                 3260
#define LC3D4S1                       3261
#define CLC3SEL3_D4S1                 3262
#define LC3D4S2                       3263
#define CLC3SEL3_D4S2                 3264
#define LC3D4S3                       3265
#define CLC3SEL3_D4S3                 3266
#define LC3D4S4                       3267
#define CLC3SEL3_D4S4                 3268
#define LC3D4S5                       3269
#define CLC3SEL3_D4S5                 3270
#define LC3D4S6                       3271
#define CLC3SEL3_D4S6                 3272
#define LC3D4S7                       3273
#define CLC3SEL3_D4S7                 3274
#define CLC3GLS0                      3275
#define CLC3GLS0_D1N                  3276
#define LC3G1D1N                      3277
#define LC3G1D1T                      3278
#define CLC3GLS0_D1T                  3279
#define LC3G1D2N                      3280
#define CLC3GLS0_D2N                  3281
#define CLC3GLS0_D2T                  3282
#define LC3G1D2T                      3283
#define CLC3GLS0_D3N                  3284
#define LC3G1D3N                      3285
#define LC3G1D3T                      3286
#define CLC3GLS0_D3T                  3287
#define CLC3GLS0_D4N                  3288
#define LC3G1D4N                      3289
#define CLC3GLS0_D4T                  3290
#define LC3G1D4T                      3291
#define CLC3GLS1                      3292
#define LC3G2D1N                      3293
#define CLC3GLS1_D1N                  3294
#define CLC3GLS1_D1T                  3295
#define LC3G2D1T                      3296
#define LC3G2D2N                      3297
#define CLC3GLS1_D2N                  3298
#define LC3G2D2T                      3299
#define CLC3GLS1_D2T                  3300
#define LC3G2D3N                      3301
#define CLC3GLS1_D3N                  3302
#define CLC3GLS1_D3T                  3303
#define LC3G2D3T                      3304
#define LC3G2D4N                      3305
#define CLC3GLS1_D4N                  3306
#define LC3G2D4T                      3307
#define CLC3GLS1_D4T                  3308
#define CLC3GLS2                      3309
#define LC3G3D1N                      3310
#define CLC3GLS2_D1N                  3311
#define LC3G3D1T                      3312
#define CLC3GLS2_D1T                  3313
#define CLC3GLS2_D2N                  3314
#define LC3G3D2N                      3315
#define CLC3GLS2_D2T                  3316
#define LC3G3D2T                      3317
#define CLC3GLS2_D3N                  3318
#define LC3G3D3N                      3319
#define LC3G3D3T                      3320
#define CLC3GLS2_D3T                  3321
#define CLC3GLS2_D4N                  3322
