tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18875_tdd.h
#define LC3G3D4N                      3323
#define CLC3GLS2_D4T                  3324
#define LC3G3D4T                      3325
#define CLC3GLS3                      3326
#define LC3G4D1N                      3327
#define CLC3GLS3_G4D1N                3328
#define LC3G4D1T                      3329
#define CLC3GLS3_G4D1T                3330
#define LC3G4D2N                      3331
#define CLC3GLS3_G4D2N                3332
#define CLC3GLS3_G4D2T                3333
#define LC3G4D2T                      3334
#define LC3G4D3N                      3335
#define CLC3GLS3_G4D3N                3336
#define CLC3GLS3_G4D3T                3337
#define LC3G4D3T                      3338
#define LC3G4D4N                      3339
#define CLC3GLS3_G4D4N                3340
#define LC3G4D4T                      3341
#define CLC3GLS3_G4D4T                3342
#define CLC4CON                       3343
#define LC4MODE                       3344
#define CLC4CON_MODE                  3345
#define LC4MODE0                      3346
#define CLC4CON_MODE0                 3347
#define LC4MODE1                      3348
#define CLC4CON_MODE1                 3349
#define LC4MODE2                      3350
#define CLC4CON_MODE2                 3351
#define LC4INTN                       3352
#define CLC4CON_INTN                  3353
#define CLC4CON_INTP                  3354
#define LC4INTP                       3355
#define CLC4CON_OUT                   3356
#define LC4OUT                        3357
#define CLC4CON_EN                    3358
#define LC4EN                         3359
#define CLC4POL                       3360
#define CLC4POL_G1POL                 3361
#define LC4G1POL                      3362
#define CLC4POL_G2POL                 3363
#define LC4G2POL                      3364
#define CLC4POL_G3POL                 3365
#define LC4G3POL                      3366
#define LC4G4POL                      3367
#define CLC4POL_G4POL                 3368
#define LC4POL                        3369
#define CLC4POL_POL                   3370
#define CLC4SEL0                      3371
#define LC4D1S0                       3372
#define CLC4SEL0_D1S                  3373
#define CLC4SEL0_D1S0                 3374
#define LC4D1S                        3375
#define LC4D1S1                       3376
#define CLC4SEL0_D1S1                 3377
#define LC4D1S2                       3378
#define CLC4SEL0_D1S2                 3379
#define LC4D1S3                       3380
#define CLC4SEL0_D1S3                 3381
#define LC4D1S4                       3382
#define CLC4SEL0_D1S4                 3383
#define LC4D1S5                       3384
#define CLC4SEL0_D1S5                 3385
#define LC4D1S6                       3386
#define CLC4SEL0_D1S6                 3387
#define LC4D1S7                       3388
#define CLC4SEL0_D1S7                 3389
#define CLC4SEL1                      3390
#define CLC4SEL1_D2S                  3391
#define CLC4SEL1_D2S0                 3392
#define LC4D2S                        3393
#define LC4D2S0                       3394
#define CLC4SEL1_D2S1                 3395
#define LC4D2S1                       3396
#define CLC4SEL1_D2S2                 3397
#define LC4D2S2                       3398
#define CLC4SEL1_D2S3                 3399
#define LC4D2S3                       3400
#define CLC4SEL1_D2S4                 3401
#define LC4D2S4                       3402
#define CLC4SEL1_D2S5                 3403
#define LC4D2S5                       3404
#define CLC4SEL1_D2S6                 3405
#define LC4D2S6                       3406
#define CLC4SEL1_D2S7                 3407
#define LC4D2S7                       3408
#define CLC4SEL2                      3409
#define CLC4SEL2_D3S                  3410
#define LC4D3S0                       3411
#define LC4D3S                        3412
#define CLC4SEL2_D3S0                 3413
#define LC4D3S1                       3414
#define CLC4SEL2_D3S1                 3415
#define LC4D3S2                       3416
#define CLC4SEL2_D3S2                 3417
#define LC4D3S3                       3418
#define CLC4SEL2_D3S3                 3419
#define LC4D3S4                       3420
#define CLC4SEL2_D3S4                 3421
#define LC4D3S5                       3422
#define CLC4SEL2_D3S5                 3423
#define LC4D3S6                       3424
#define CLC4SEL2_D3S6                 3425
#define LC4D3S7                       3426
#define CLC4SEL2_D3S7                 3427
#define CLC4SEL3                      3428
#define CLC4SEL3_D4S                  3429
#define LC4D4S0                       3430
#define CLC4SEL3_D4S0                 3431
#define LC4D4S                        3432
#define LC4D4S1                       3433
#define CLC4SEL3_D4S1                 3434
#define LC4D4S2                       3435
#define CLC4SEL3_D4S2                 3436
#define LC4D4S3                       3437
#define CLC4SEL3_D4S3                 3438
#define LC4D4S4                       3439
#define CLC4SEL3_D4S4                 3440
#define LC4D4S5                       3441
#define CLC4SEL3_D4S5                 3442
#define LC4D4S6                       3443
#define CLC4SEL3_D4S6                 3444
#define LC4D4S7                       3445
#define CLC4SEL3_D4S7                 3446
#define CLC4GLS0                      3447
#define CLC4GLS0_D1N                  3448
#define LC4G1D1N                      3449
#define CLC4GLS0_D1T                  3450
#define LC4G1D1T                      3451
#define CLC4GLS0_D2N                  3452
#define LC4G1D2N                      3453
#define CLC4GLS0_D2T                  3454
#define LC4G1D2T                      3455
#define CLC4GLS0_D3N                  3456
#define LC4G1D3N                      3457
#define CLC4GLS0_D3T                  3458
#define LC4G1D3T                      3459
#define CLC4GLS0_D4N                  3460
#define LC4G1D4N                      3461
#define CLC4GLS0_D4T                  3462
#define LC4G1D4T                      3463
#define CLC4GLS1                      3464
#define CLC4GLS1_D1N                  3465
#define LC4G2D1N                      3466
#define CLC4GLS1_D1T                  3467
#define LC4G2D1T                      3468
#define LC4G2D2N                      3469
#define CLC4GLS1_D2N                  3470
#define LC4G2D2T                      3471
#define CLC4GLS1_D2T                  3472
#define CLC4GLS1_D3N                  3473
#define LC4G2D3N                      3474
#define LC4G2D3T                      3475
#define CLC4GLS1_D3T                  3476
#define CLC4GLS1_D4N                  3477
#define LC4G2D4N                      3478
#define CLC4GLS1_D4T                  3479
#define LC4G2D4T                      3480
#define CLC4GLS2                      3481
#define CLC4GLS2_D1N                  3482
#define LC4G3D1N                      3483
#define CLC4GLS2_D1T                  3484
#define LC4G3D1T                      3485
#define LC4G3D2N                      3486
#define CLC4GLS2_D2N                  3487
#define LC4G3D2T                      3488
#define CLC4GLS2_D2T                  3489
#define CLC4GLS2_D3N                  3490
#define LC4G3D3N                      3491
#define CLC4GLS2_D3T                  3492
#define LC4G3D3T                      3493
#define LC4G3D4N                      3494
#define CLC4GLS2_D4N                  3495
#define LC4G3D4T                      3496
#define CLC4GLS2_D4T                  3497
#define CLC4GLS3                      3498
#define CLC4GLS3_G4D1N                3499
#define LC4G4D1N                      3500
#define LC4G4D1T                      3501
#define CLC4GLS3_G4D1T                3502
#define LC4G4D2N                      3503
#define CLC4GLS3_G4D2N                3504
#define LC4G4D2T                      3505
#define CLC4GLS3_G4D2T                3506
#define CLC4GLS3_G4D3N                3507
#define LC4G4D3N                      3508
#define CLC4GLS3_G4D3T                3509
#define LC4G4D3T                      3510
#define LC4G4D4N                      3511
#define CLC4GLS3_G4D4N                3512
#define LC4G4D4T                      3513
#define CLC4GLS3_G4D4T                3514
#define PPSLOCK                       3515
#define PPSLOCKED                     3516
#define INTPPS0                       3517
#define INTPPS                        3518
#define INTPPS1                       3519
#define INTPPS2                       3520
#define INTPPS3                       3521
#define T0CKIPPS                      3522
#define T0CKIPPS0                     3523
#define T0CKIPPS1                     3524
#define T0CKIPPS2                     3525
#define T0CKIPPS3                     3526
#define T1CKIPPS0                     3527
#define T1CKIPPS                      3528
#define T1CKIPPS1                     3529
#define T1CKIPPS2                     3530
#define T1CKIPPS3                     3531
#define T1CKIPPS4                     3532
#define T1GPPS0                       3533
#define T1GPPS                        3534
#define T1GPPS1                       3535
#define T1GPPS2                       3536
#define T1GPPS3                       3537
#define T1GPPS4                       3538
#define T3CKIPPS0                     3539
#define T3CKIPPS                      3540
#define T3CKIPPS1                     3541
#define T3CKIPPS2                     3542
#define T3CKIPPS3                     3543
#define T3CKIPPS4                     3544
#define T3GPPS0                       3545
#define T3GPPS                        3546
#define T3GPPS1                       3547
#define T3GPPS2                       3548
#define T3GPPS3                       3549
#define T3GPPS4                       3550
#define T5CKIPPS0                     3551
#define T5CKIPPS                      3552
#define T5CKIPPS1                     3553
#define T5CKIPPS2                     3554
#define T5CKIPPS3                     3555
#define T5CKIPPS4                     3556
#define T5GPPS                        3557
#define T5GPPS0                       3558
#define T5GPPS1                       3559
#define T5GPPS2                       3560
#define T5GPPS3                       3561
#define T5GPPS4                       3562
#define T2AINPPS                      3563
#define T2AINPPS0                     3564
#define T2AINPPS1                     3565
#define T2AINPPS2                     3566
#define T2AINPPS3                     3567
#define T2AINPPS4                     3568
#define T4AINPPS                      3569
#define T4AINPPS0                     3570
#define T4AINPPS1                     3571
#define T4AINPPS2                     3572
#define T4AINPPS3                     3573
#define T4AINPPS4                     3574
#define T6AINPPS0                     3575
#define T6AINPPS                      3576
#define T6AINPPS1                     3577
#define T6AINPPS2                     3578
#define T6AINPPS3                     3579
#define T6AINPPS4                     3580
#define CCP1PPS0                      3581
#define CCP1PPS                       3582
#define CCP1PPS1                      3583
#define CCP1PPS2                      3584
#define CCP1PPS3                      3585
#define CCP1PPS4                      3586
#define CCP2PPS0                      3587
#define CCP2PPS                       3588
#define CCP2PPS1                      3589
#define CCP2PPS2                      3590
#define CCP2PPS3                      3591
#define CCP2PPS4                      3592
#define CCP3PPS0                      3593
#define CCP3PPS                       3594
#define CCP3PPS1                      3595
#define CCP3PPS2                      3596
#define CCP3PPS3                      3597
#define CCP3PPS4                      3598
#define CCP4PPS0                      3599
#define CCP4PPS                       3600
#define CCP4PPS1                      3601
#define CCP4PPS2                      3602
#define CCP4PPS3                      3603
#define CCP4PPS4                      3604
#define CCP5PPS                       3605
#define CCP5PPS0                      3606
#define CCP5PPS1                      3607
#define CCP5PPS2                      3608
#define CCP5PPS3                      3609
#define CCP5PPS4                      3610
#define CCP6PPS                       3611
#define SMT1WINPPS                    3612
#define SMU1WINPPS0                   3613
#define SMU1WINPPS1                   3614
#define SMU1WINPPS2                   3615
#define SMU1WINPPS3                   3616
#define SMU1WINPPS4                   3617
#define SMT1SIGPPS                    3618
#define SMU1SIGPPS0                   3619
#define SMU1SIGPPS1                   3620
#define SMU1SIGPPS2                   3621
#define SMU1SIGPPS3                   3622
#define SMU1SIGPPS4                   3623
#define SMT2WINPPS                    3624
#define SMU2WINPPS0                   3625
#define SMU2WINPPS1                   3626
#define SMU2WINPPS2                   3627
#define SMU2WINPPS3                   3628
#define SMU2WINPPS4                   3629
#define SMT2SIGPPS                    3630
#define SMU2SIGPPS0                   3631
#define SMU2SIGPPS1                   3632
#define SMU2SIGPPS2                   3633
#define SMU2SIGPPS3                   3634
#define SMU2SIGPPS4                   3635
#define CWG1PPS0                      3636
#define CWG1PPS                       3637
#define CWG1PPS1                      3638
#define CWG1PPS2                      3639
#define CWG1PPS3                      3640
#define CWG1PPS4                      3641
#define CWG2PPS0                      3642
#define CWG2PPS                       3643
#define CWG2PPS1                      3644
#define CWG2PPS2                      3645
#define CWG2PPS3                      3646
#define CWG2PPS4                      3647
#define CWG3PPS0                      3648
#define CWG3PPS                       3649
#define CWG3PPS1                      3650
#define CWG3PPS2                      3651
#define CWG3PPS3                      3652
#define CWG3PPS4                      3653
#define MDCARLPPS                     3654
#define MDCARLPPS0                    3655
#define MDCARLPPS1                    3656
#define MDCARLPPS2                    3657
#define MDCARLPPS3                    3658
#define MDCARLPPS4                    3659
#define MDCARHPPS0                    3660
#define MDCARHPPS                     3661
#define MDCARHPPS1                    3662
#define MDCARHPPS2                    3663
#define MDCARHPPS3                    3664
#define MDCARHPPS4                    3665
#define MDSRCPPS0                     3666
#define MDSRCPPS                      3667
#define MDSRCPPS1                     3668
#define MDSRCPPS2                     3669
#define MDSRCPPS3                     3670
#define MDSRCPPS4                     3671
#define CLCIN0PPS                     3672
#define CLCIN0PPS0                    3673
#define CLCIN0PPS1                    3674
#define CLCIN0PPS2                    3675
#define CLCIN0PPS3                    3676
#define CLCIN0PPS4                    3677
#define CLCIN1PPS                     3678
#define CLCIN1PPS0                    3679
#define CLCIN1PPS1                    3680
#define CLCIN1PPS2                    3681
#define CLCIN1PPS3                    3682
#define CLCIN1PPS4                    3683
#define CLCIN2PPS                     3684
#define CLCIN2PPS0                    3685
#define CLCIN2PPS1                    3686
#define CLCIN2PPS2                    3687
#define CLCIN2PPS3                    3688
#define CLCIN2PPS4                    3689
#define CLCIN3PPS                     3690
#define CLCIN3PPS0                    3691
#define CLCIN3PPS1                    3692
#define CLCIN3PPS2                    3693
#define CLCIN3PPS3                    3694
#define CLCIN3PPS4                    3695
#define ADCACTPPS                     3696
#define ADCACTPPS0                    3697
#define ADCACTPPS1                    3698
#define ADCACTPPS2                    3699
#define ADCACTPPS3                    3700
#define ADCACTPPS4                    3701
#define SSP1CLKPPS                    3702
#define SSP1CLKPPS0                   3703
#define SSP1CLKPPS1                   3704
#define SSP1CLKPPS2                   3705
#define SSP1CLKPPS3                   3706
#define SSP1CLKPPS4                   3707
#define SSP1DATPPS                    3708
#define SSP1DATPPS0                   3709
#define SSP1DATPPS1                   3710
#define SSP1DATPPS2                   3711
#define SSP1DATPPS3                   3712
#define SSP1DATPPS4                   3713
#define SSP1SSPPS                     3714
#define SSP1SSPPS0                    3715
#define SSP1SSPPS1                    3716
#define SSP1SSPPS2                    3717
#define SSP1SSPPS3                    3718
#define SSP1SSPPS4                    3719
#define SSP2CLKPPS                    3720
#define SSP2CLKPPS0                   3721
#define SSP2CLKPPS1                   3722
#define SSP2CLKPPS2                   3723
#define SSP2CLKPPS3                   3724
#define SSP2CLKPPS4                   3725
#define SSP2DATPPS                    3726
#define SSP2DATPPS0                   3727
#define SSP2DATPPS1                   3728
#define SSP2DATPPS2                   3729
#define SSP2DATPPS3                   3730
#define SSP2DATPPS4                   3731
#define SSP2SSPPS                     3732
#define SSP2SSPPS0                    3733
#define SSP2SSPPS1                    3734
#define SSP2SSPPS2                    3735
#define SSP2SSPPS3                    3736
#define SSP2SSPPS4                    3737
#define RXPPS                         3738
#define RXPPS0                        3739
#define RXPPS1                        3740
#define RXPPS2                        3741
#define RXPPS3                        3742
#define RXPPS4                        3743
#define TXPPS                         3744
#define TXPPS0                        3745
#define TXPPS1                        3746
#define TXPPS2                        3747
#define TXPPS3                        3748
#define TXPPS4                        3749
#define RA0PPS                        3750
#define RA0PPS0                       3751
#define RA0PPS1                       3752
#define RA0PPS2                       3753
#define RA0PPS3                       3754
#define RA0PPS4                       3755
#define RA0PPS5                       3756
#define RA1PPS                        3757
#define RA1PPS0                       3758
#define RA1PPS1                       3759
#define RA1PPS2                       3760
#define RA1PPS3                       3761
#define RA1PPS4                       3762
#define RA1PPS5                       3763
#define RA2PPS                        3764
#define RA2PPS0                       3765
#define RA2PPS1                       3766
#define RA2PPS2                       3767
#define RA2PPS3                       3768
#define RA2PPS4                       3769
#define RA2PPS5                       3770
#define RA3PPS                        3771
#define RA3PPS0                       3772
#define RA3PPS1                       3773
#define RA3PPS2                       3774
#define RA3PPS3                       3775
#define RA3PPS4                       3776
#define RA3PPS5                       3777
#define RA4PPS                        3778
#define RA4PPS0                       3779
#define RA4PPS1                       3780
#define RA4PPS2                       3781
#define RA4PPS3                       3782
#define RA4PPS4                       3783
#define RA4PPS5                       3784
#define RA5PPS                        3785
#define RA5PPS0                       3786
#define RA5PPS1                       3787
#define RA5PPS2                       3788
#define RA5PPS3                       3789
#define RA5PPS4                       3790
#define RA5PPS5                       3791
#define RA6PPS                        3792
#define RA6PPS0                       3793
#define RA6PPS1                       3794
#define RA6PPS2                       3795
#define RA6PPS3                       3796
#define RA6PPS4                       3797
#define RA6PPS5                       3798
#define RA7PPS                        3799
#define RA7PPS0                       3800
#define RA7PPS1                       3801
#define RA7PPS2                       3802
#define RA7PPS3                       3803
#define RA7PPS4                       3804
#define RA7PPS5                       3805
#define RB0PPS                        3806
#define RB0PPS0                       3807
#define RB0PPS1                       3808
#define RB0PPS2                       3809
#define RB0PPS3                       3810
#define RB0PPS4                       3811
#define RB0PPS5                       3812
#define RB1PPS                        3813
#define RB1PPS0                       3814
#define RB1PPS1                       3815
#define RB1PPS2                       3816
#define RB1PPS3                       3817
#define RB1PPS4                       3818
#define RB1PPS5                       3819
#define RB2PPS                        3820
#define RB2PPS0                       3821
#define RB2PPS1                       3822
#define RB2PPS2                       3823
#define RB2PPS3                       3824
#define RB2PPS4                       3825
#define RB2PPS5                       3826
#define RB3PPS                        3827
#define RB3PPS0                       3828
#define RB3PPS1                       3829
#define RB3PPS2                       3830
#define RB3PPS3                       3831
#define RB3PPS4                       3832
#define RB3PPS5                       3833
#define RB4PPS                        3834
#define RB4PPS0                       3835
#define RB4PPS1                       3836
#define RB4PPS2                       3837
#define RB4PPS3                       3838
#define RB4PPS4                       3839
#define RB4PPS5                       3840
#define RB5PPS                        3841
#define RB5PPS0                       3842
#define RB5PPS1                       3843
#define RB5PPS2                       3844
#define RB5PPS3                       3845
#define RB5PPS4                       3846
#define RB5PPS5                       3847
#define RB6PPS                        3848
#define RB6PPS0                       3849
#define RB6PPS1                       3850
#define RB6PPS2                       3851
#define RB6PPS3                       3852
#define RB6PPS4                       3853
#define RB6PPS5                       3854
#define RB7PPS                        3855
#define RB7PPS0                       3856
#define RB7PPS1                       3857
#define RB7PPS2                       3858
#define RB7PPS3                       3859
#define RB7PPS4                       3860
#define RB7PPS5                       3861
#define RC0PPS                        3862
#define RC0PPS0                       3863
#define RC0PPS1                       3864
#define RC0PPS2                       3865
#define RC0PPS3                       3866
#define RC0PPS4                       3867
#define RC0PPS5                       3868
#define RC1PPS                        3869
#define RC1PPS0                       3870
#define RC1PPS1                       3871
#define RC1PPS2                       3872
#define RC1PPS3                       3873
#define RC1PPS4                       3874
#define RC1PPS5                       3875
#define RC2PPS                        3876
#define RC2PPS0                       3877
#define RC2PPS1                       3878
#define RC2PPS2                       3879
#define RC2PPS3                       3880
