tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18875_tdd.h
#define RC2PPS4                       3881
#define RC2PPS5                       3882
#define RC3PPS                        3883
#define RC3PPS0                       3884
#define RC3PPS1                       3885
#define RC3PPS2                       3886
#define RC3PPS3                       3887
#define RC3PPS4                       3888
#define RC3PPS5                       3889
#define RC4PPS                        3890
#define RC4PPS0                       3891
#define RC4PPS1                       3892
#define RC4PPS2                       3893
#define RC4PPS3                       3894
#define RC4PPS4                       3895
#define RC4PPS5                       3896
#define RC5PPS                        3897
#define RC5PPS0                       3898
#define RC5PPS1                       3899
#define RC5PPS2                       3900
#define RC5PPS3                       3901
#define RC5PPS4                       3902
#define RC5PPS5                       3903
#define RC6PPS                        3904
#define RC6PPS0                       3905
#define RC6PPS1                       3906
#define RC6PPS2                       3907
#define RC6PPS3                       3908
#define RC6PPS4                       3909
#define RC6PPS5                       3910
#define RC7PPS                        3911
#define RC7PPS0                       3912
#define RC7PPS1                       3913
#define RC7PPS2                       3914
#define RC7PPS3                       3915
#define RC7PPS4                       3916
#define RC7PPS5                       3917
#define RD0PPS                        3918
#define RD0PPS0                       3919
#define RD0PPS1                       3920
#define RD0PPS2                       3921
#define RD0PPS3                       3922
#define RD0PPS4                       3923
#define RD0PPS5                       3924
#define RD1PPS                        3925
#define RD1PPS0                       3926
#define RD1PPS1                       3927
#define RD1PPS2                       3928
#define RD1PPS3                       3929
#define RD1PPS4                       3930
#define RD1PPS5                       3931
#define RD2PPS                        3932
#define RD2PPS0                       3933
#define RD2PPS1                       3934
#define RD2PPS2                       3935
#define RD2PPS3                       3936
#define RD2PPS4                       3937
#define RD2PPS5                       3938
#define RD3PPS                        3939
#define RD3PPS0                       3940
#define RD3PPS1                       3941
#define RD3PPS2                       3942
#define RD3PPS3                       3943
#define RD3PPS4                       3944
#define RD3PPS5                       3945
#define RD4PPS                        3946
#define RD4PPS0                       3947
#define RD4PPS1                       3948
#define RD4PPS2                       3949
#define RD4PPS3                       3950
#define RD4PPS4                       3951
#define RD4PPS5                       3952
#define RD5PPS                        3953
#define RD5PPS0                       3954
#define RD5PPS1                       3955
#define RD5PPS2                       3956
#define RD5PPS3                       3957
#define RD5PPS4                       3958
#define RD5PPS5                       3959
#define RD6PPS                        3960
#define RD6PPS0                       3961
#define RD6PPS1                       3962
#define RD6PPS2                       3963
#define RD6PPS3                       3964
#define RD6PPS4                       3965
#define RD6PPS5                       3966
#define RD7PPS                        3967
#define RD7PPS0                       3968
#define RD7PPS1                       3969
#define RD7PPS2                       3970
#define RD7PPS3                       3971
#define RD7PPS4                       3972
#define RD7PPS5                       3973
#define RE0PPS                        3974
#define RE0PPS0                       3975
#define RE0PPS1                       3976
#define RE0PPS2                       3977
#define RE0PPS3                       3978
#define RE0PPS4                       3979
#define RE0PPS5                       3980
#define RE1PPS                        3981
#define RE1PPS0                       3982
#define RE1PPS1                       3983
#define RE1PPS2                       3984
#define RE1PPS3                       3985
#define RE1PPS4                       3986
#define RE1PPS5                       3987
#define RE2PPS                        3988
#define RE2PPS0                       3989
#define RE2PPS1                       3990
#define RE2PPS2                       3991
#define RE2PPS3                       3992
#define RE2PPS4                       3993
#define RE2PPS5                       3994
#define ANSELA                        3995
#define ANSA0                         3996
#define ANSA1                         3997
#define ANSA2                         3998
#define ANSA3                         3999
#define ANSA4                         4000
#define ANSA5                         4001
#define ANSA6                         4002
#define ANSA7                         4003
#define WPUA                          4004
#define WPUA0                         4005
#define WPUA1                         4006
#define WPUA2                         4007
#define WPUA3                         4008
#define WPUA4                         4009
#define WPUA5                         4010
#define WPUA6                         4011
#define WPUA7                         4012
#define ODCONA                        4013
#define ODCA0                         4014
#define ODCA1                         4015
#define ODCA2                         4016
#define ODCA3                         4017
#define ODCA4                         4018
#define ODCA5                         4019
#define ODCA6                         4020
#define ODCA7                         4021
#define SLRCONA                       4022
#define SLRA0                         4023
#define SLRA1                         4024
#define SLRA2                         4025
#define SLRA3                         4026
#define SLRA4                         4027
#define SLRA5                         4028
#define SLRA6                         4029
#define SLRA7                         4030
#define INLVLA                        4031
#define INLVLA0                       4032
#define INLVLA1                       4033
#define INLVLA2                       4034
#define INLVLA3                       4035
#define INLVLA4                       4036
#define INLVLA5                       4037
#define INLVLA6                       4038
#define INLVLA7                       4039
#define IOCAP                         4040
#define IOCAP0                        4041
#define IOCAP1                        4042
#define IOCAP2                        4043
#define IOCAP3                        4044
#define IOCAP4                        4045
#define IOCAP5                        4046
#define IOCAP6                        4047
#define IOCAP7                        4048
#define IOCAN                         4049
#define IOCAN0                        4050
#define IOCAN1                        4051
#define IOCAN2                        4052
#define IOCAN3                        4053
#define IOCAN4                        4054
#define IOCAN5                        4055
#define IOCAN6                        4056
#define IOCAN7                        4057
#define IOCAF                         4058
#define IOCAF0                        4059
#define IOCAF1                        4060
#define IOCAF2                        4061
#define IOCAF3                        4062
#define IOCAF4                        4063
#define IOCAF5                        4064
#define IOCAF6                        4065
#define IOCAF7                        4066
#define CCDNA                         4067
#define CCDNA0                        4068
#define CCDNA1                        4069
#define CCDNA2                        4070
#define CCDNA3                        4071
#define CCDNA4                        4072
#define CCDNA5                        4073
#define CCDNA6                        4074
#define CCDNA7                        4075
#define CCDPA                         4076
#define CCDPA0                        4077
#define CCDPA1                        4078
#define CCDPA2                        4079
#define CCDPA3                        4080
#define CCDPA4                        4081
#define CCDPA5                        4082
#define CCDPA6                        4083
#define CCDPA7                        4084
#define ANSELB                        4085
#define ANSB0                         4086
#define ANSB1                         4087
#define ANSB2                         4088
#define ANSB3                         4089
#define ANSB4                         4090
#define ANSB5                         4091
#define ANSB6                         4092
#define ANSB7                         4093
#define WPUB                          4094
#define WPUB0                         4095
#define WPUB1                         4096
#define WPUB2                         4097
#define WPUB3                         4098
#define WPUB4                         4099
#define WPUB5                         4100
#define WPUB6                         4101
#define WPUB7                         4102
#define ODCONB                        4103
#define ODCB0                         4104
#define ODCB1                         4105
#define ODCB2                         4106
#define ODCB3                         4107
#define ODCB4                         4108
#define ODCB5                         4109
#define ODCB6                         4110
#define ODCB7                         4111
#define SLRCONB                       4112
#define SLRB0                         4113
#define SLRB1                         4114
#define SLRB2                         4115
#define SLRB3                         4116
#define SLRB4                         4117
#define SLRB5                         4118
#define SLRB6                         4119
#define SLRB7                         4120
#define INLVLB                        4121
#define INLVLB0                       4122
#define INLVLB1                       4123
#define INLVLB2                       4124
#define INLVLB3                       4125
#define INLVLB4                       4126
#define INLVLB5                       4127
#define INLVLB6                       4128
#define INLVLB7                       4129
#define IOCBP                         4130
#define IOCBP0                        4131
#define IOCBP1                        4132
#define IOCBP2                        4133
#define IOCBP3                        4134
#define IOCBP4                        4135
#define IOCBP5                        4136
#define IOCBP6                        4137
#define IOCBP7                        4138
#define IOCBN                         4139
#define IOCBN0                        4140
#define IOCBN1                        4141
#define IOCBN2                        4142
#define IOCBN3                        4143
#define IOCBN4                        4144
#define IOCBN5                        4145
#define IOCBN6                        4146
#define IOCBN7                        4147
#define IOCBF                         4148
#define IOCBF0                        4149
#define IOCBF1                        4150
#define IOCBF2                        4151
#define IOCBF3                        4152
#define IOCBF4                        4153
#define IOCBF5                        4154
#define IOCBF6                        4155
#define IOCBF7                        4156
#define CCDNB                         4157
#define CCDNB0                        4158
#define CCDNB1                        4159
#define CCDNB2                        4160
#define CCDNB3                        4161
#define CCDNB4                        4162
#define CCDNB5                        4163
#define CCDNB6                        4164
#define CCDNB7                        4165
#define CCDPB                         4166
#define CCDPB0                        4167
#define CCDPB1                        4168
#define CCDPB2                        4169
#define CCDPB3                        4170
#define CCDPB4                        4171
#define CCDPB5                        4172
#define CCDPB6                        4173
#define CCDPB7                        4174
#define ANSELC                        4175
#define ANSC0                         4176
#define ANSC1                         4177
#define ANSC2                         4178
#define ANSC3                         4179
#define ANSC4                         4180
#define ANSC5                         4181
#define ANSC6                         4182
#define ANSC7                         4183
#define WPUC                          4184
#define WPUC0                         4185
#define WPUC1                         4186
#define WPUC2                         4187
#define WPUC3                         4188
#define WPUC4                         4189
#define WPUC5                         4190
#define WPUC6                         4191
#define WPUC7                         4192
#define ODCONC                        4193
#define ODCC0                         4194
#define ODCC1                         4195
#define ODCC2                         4196
#define ODCC3                         4197
#define ODCC4                         4198
#define ODCC5                         4199
#define ODCC6                         4200
#define ODCC7                         4201
#define SLRCONC                       4202
#define SLRC0                         4203
#define SLRC1                         4204
#define SLRC2                         4205
#define SLRC3                         4206
#define SLRC4                         4207
#define SLRC5                         4208
#define SLRC6                         4209
#define SLRC7                         4210
#define INLVLC                        4211
#define INLVLC0                       4212
#define INLVLC1                       4213
#define INLVLC2                       4214
#define INLVLC3                       4215
#define INLVLC4                       4216
#define INLVLC5                       4217
#define INLVLC6                       4218
#define INLVLC7                       4219
#define IOCCP                         4220
#define IOCCP0                        4221
#define IOCCP1                        4222
#define IOCCP2                        4223
#define IOCCP3                        4224
#define IOCCP4                        4225
#define IOCCP5                        4226
#define IOCCP6                        4227
#define IOCCP7                        4228
#define IOCCN                         4229
#define IOCCN0                        4230
#define IOCCN1                        4231
#define IOCCN2                        4232
#define IOCCN3                        4233
#define IOCCN4                        4234
#define IOCCN5                        4235
#define IOCCN6                        4236
#define IOCCN7                        4237
#define IOCCF                         4238
#define IOCCF0                        4239
#define IOCCF1                        4240
#define IOCCF2                        4241
#define IOCCF3                        4242
#define IOCCF4                        4243
#define IOCCF5                        4244
#define IOCCF6                        4245
#define IOCCF7                        4246
#define CCDNC                         4247
#define CCDNC0                        4248
#define CCDNC1                        4249
#define CCDNC2                        4250
#define CCDNC3                        4251
#define CCDNC4                        4252
#define CCDNC5                        4253
#define CCDNC6                        4254
#define CCDNC7                        4255
#define CCDPC                         4256
#define CCDPC0                        4257
#define CCDPC1                        4258
#define CCDPC2                        4259
#define CCDPC3                        4260
#define CCDPC4                        4261
#define CCDPC5                        4262
#define CCDPC6                        4263
#define CCDPC7                        4264
#define ANSELD                        4265
#define ANSD0                         4266
#define ANSD1                         4267
#define ANSD2                         4268
#define ANSD3                         4269
#define ANSD4                         4270
#define ANSD5                         4271
#define ANSD6                         4272
#define ANSD7                         4273
#define WPUD                          4274
#define WPUD0                         4275
#define WPUD1                         4276
#define WPUD2                         4277
#define WPUD3                         4278
#define WPUD4                         4279
#define WPUD5                         4280
#define WPUD6                         4281
#define WPUD7                         4282
#define ODCOND                        4283
#define ODCD0                         4284
#define ODCD1                         4285
#define ODCD2                         4286
#define ODCD3                         4287
#define ODCD4                         4288
#define ODCD5                         4289
#define ODCD6                         4290
#define ODCD7                         4291
#define SLRCOND                       4292
#define SLRD0                         4293
#define SLRD1                         4294
#define SLRD2                         4295
#define SLRD3                         4296
#define SLRD4                         4297
#define SLRD5                         4298
#define SLRD6                         4299
#define SLRD7                         4300
#define INLVLD                        4301
#define INLVLD0                       4302
#define INLVLD1                       4303
#define INLVLD2                       4304
#define INLVLD3                       4305
#define INLVLD4                       4306
#define INLVLD5                       4307
#define INLVLD6                       4308
#define INLVLD7                       4309
#define CCDND                         4310
#define CCDND0                        4311
#define CCDND1                        4312
#define CCDND2                        4313
#define CCDND3                        4314
#define CCDND4                        4315
#define CCDND5                        4316
#define CCDND6                        4317
#define CCDND7                        4318
#define CCDPD                         4319
#define CCDPD0                        4320
#define CCDPD1                        4321
#define CCDPD2                        4322
#define CCDPD3                        4323
#define CCDPD4                        4324
#define CCDPD5                        4325
#define CCDPD6                        4326
#define CCDPD7                        4327
#define ANSELE                        4328
#define ANSE0                         4329
#define ANSE1                         4330
#define ANSE2                         4331
#define WPUE                          4332
#define WPUE0                         4333
#define WPUE1                         4334
#define WPUE2                         4335
#define WPUE3                         4336
#define ODCONE                        4337
#define ODCE0                         4338
#define ODCE1                         4339
#define ODCE2                         4340
#define SLRCONE                       4341
#define SLRE0                         4342
#define SLRE1                         4343
#define SLRE2                         4344
#define INLVLE                        4345
#define INLVLE0                       4346
#define INLVLE1                       4347
#define INLVLE2                       4348
#define INLVLE3                       4349
#define IOCEP                         4350
#define IOCEP3                        4351
#define IOCEN                         4352
#define IOCEN3                        4353
#define IOCEF                         4354
#define IOCEF3                        4355
#define CCDNE                         4356
#define CCDNE0                        4357
#define CCDNE1                        4358
#define CCDNE2                        4359
#define CCDPE                         4360
#define CCDPE0                        4361
#define CCDPE1                        4362
#define CCDPE2                        4363
#define STATUS_SHAD                   4364
#define C_SHAD                        4365
#define DC_SHAD                       4366
#define Z_SHAD                        4367
#define WREG_SHAD                     4368
#define BSR_SHAD                      4369
#define PCLATH_SHAD                   4370
#define FSR0L_SHAD                    4371
#define FSR0H_SHAD                    4372
#define FSR1L_SHAD                    4373
#define FSR1H_SHAD                    4374
#define STKPTR                        4375
#define TOSL                          4376
#define TOSH                          4377

#endif // _PIC16F18875_H_
